Revit 2026 API

# WireMaterialTypeRemoveTemperatureRatingType Method

---

Remove an existing temperature rating type from this material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveTemperatureRatingType(
	TemperatureRatingType temperatureRating
)
```
```vb
Public Sub RemoveTemperatureRatingType (
	temperatureRating As TemperatureRatingType
)
```
```cpp
public:
void RemoveTemperatureRatingType(
	TemperatureRatingType^ temperatureRating
)
```
```fsharp
member RemoveTemperatureRatingType :
        temperatureRating : TemperatureRatingType -> unit
```

#### Parameters

temperatureRating TemperatureRatingType
    The temperature rating type to be removed.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The last temperature rating type of project and any one used by a wire type can't be removed. |

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace